Revit 2024 API
BoundingBoxIsInsideFilter.Tolerance Property
 Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double Tolerance { get; set; }
Visual Basic
Public Property Tolerance As Double
	Get
	Set
Visual C++
public:
property double Tolerance {
	double get ();
	void set (double value);
}
Remarks
 By default this is set to zero, but depending on your units of measure and how close objects may be, it is advised to set this to something more realistic. If the tolerance is positive, the iterated element's Outline may extend the tolerance distance outside of the given Outline in each coordinate to be a match. If the tolerance is negative, the iterated element's Outline must lie at least the tolerance distance inside the given Outline in each coordinate to be a match.
See Also
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace